# Day 39 â€“ Merge, Join & Concatenate with Pandas

In [1]:

import pandas as pd

## Sample DataFrames

In [2]:

df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['A', 'B', 'C']
})

df2 = pd.DataFrame({
    'id': [2, 3, 4],
    'score': [80, 90, 85]
})

df1, df2

(   id name
 0   1    A
 1   2    B
 2   3    C,
    id  score
 0   2     80
 1   3     90
 2   4     85)

## Merge (Inner Join)

In [3]:

pd.merge(df1, df2, on='id', how='inner')

   id name  score
0   2    B     80
1   3    C     90

## Merge (Left, Right, Outer)

In [4]:

pd.merge(df1, df2, on='id', how='left')

   id name  score
0   1    A    NaN
1   2    B   80.0
2   3    C   90.0

In [5]:

pd.merge(df1, df2, on='id', how='right')

   id name  score
0   2    B     80
1   3    C     90
2   4  NaN     85

In [6]:

pd.merge(df1, df2, on='id', how='outer')

   id name  score
0   1    A    NaN
1   2    B   80.0
2   3    C   90.0
3   4  NaN   85.0

## Join using Index

In [7]:

df1_indexed = df1.set_index('id')
df2_indexed = df2.set_index('id')

df1_indexed.join(df2_indexed)

   name  score
id
1     A    NaN
2     B   80.0
3     C   90.0

## Concatenate (Vertical)

In [8]:

pd.concat([df1, df1], axis=0)

   id name
0   1    A
1   2    B
2   3    C
0   1    A
1   2    B
2   3    C

## Concatenate (Horizontal)

In [9]:

pd.concat([df1, df2], axis=1)

   id name  id  score
0   1    A   2     80
1   2    B   3     90
2   3    C   4     85